-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: j8b107.p.ssafy.io    Database: hwilyric
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `newly_trend`
--

DROP TABLE IF EXISTS `newly_trend`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `newly_trend` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT 'PK',
  `genre` varchar(50) NOT NULL COMMENT '장르명',
  `count` int NOT NULL COMMENT '장르수',
  `keywords` varchar(1000) NOT NULL COMMENT '키워드들',
  `released_date` date NOT NULL COMMENT '발매일',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=56 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `newly_trend`
--

LOCK TABLES `newly_trend` WRITE;
/*!40000 ALTER TABLE `newly_trend` DISABLE KEYS */;
INSERT INTO `newly_trend` VALUES (1,'인디음악',36,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(2,'R&B/Soul',38,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(3,'일렉트로니카',3,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(4,'발라드',38,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(5,'록/메탈',12,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(6,'랩/힙합',20,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(7,'국내드라마',15,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(8,'포크/블루스',6,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(9,'크로스오버',1,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(10,'성인가요/트로트',4,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(11,'애니메이션/웹툰',3,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(12,'클래식',2,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(13,'댄스',15,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(14,'교향/관현악',1,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(15,'국내뮤지컬',1,'you,like,the,all,You,night,사랑을,told,그만하자,know,down,and,When,속에서,보이지,really,would,don\'t,사랑일까,said','2023-04-03'),(16,'인디음악',44,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(17,'R&B/Soul',34,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(18,'발라드',54,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(19,'록/메탈',16,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(20,'애니메이션/웹툰',6,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(21,'댄스',13,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(22,'랩/힙합',27,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(23,'포크/블루스',10,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(24,'국내드라마',18,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(25,'크로스오버',4,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(26,'성인가요/트로트',3,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(27,'국악',3,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(28,'게임',2,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(29,'일렉트로니카',4,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(30,'클래식',1,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(31,'뉴에이지',1,'모르다,그렇다,버리다,나르다,떠나다,아니다,해주다,어떻다,기다리다,되어다,아프다,원하다,이렇다,아름답다,만나다,멈추다,보이다,삭이다,멀어지다,행복하다','2023-03-27'),(32,'인디음악',50,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(33,'R&B/Soul',43,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(34,'일렉트로니카',5,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(35,'발라드',59,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(36,'록/메탈',18,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(37,'애니메이션/웹툰',5,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(38,'댄스',7,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(39,'랩/힙합',29,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(40,'국내드라마',16,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(41,'포크/블루스',6,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(42,'성인가요/트로트',2,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(43,'국내뮤지컬',1,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(44,'인디음악',50,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(45,'R&B/Soul',43,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(46,'일렉트로니카',5,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(47,'발라드',59,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(48,'록/메탈',18,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(49,'애니메이션/웹툰',5,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(50,'댄스',7,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(51,'랩/힙합',29,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(52,'국내드라마',16,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(53,'포크/블루스',6,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(54,'성인가요/트로트',2,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20'),(55,'국내뮤지컬',1,'모르다,그렇다,나르다,아니다,어떻다,버리다,아프다,기다리다,괜찮다,궁금하다,해주다,바라보다,만나다,만들다,보내다,돌아오다,좋아하다,영원하다,돌아가다,어떡하다','2023-03-20');
/*!40000 ALTER TABLE `newly_trend` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-06 16:07:50
